In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'Data': ['2024-03-01', '2024-03-01', '2024-03-02', '2024-03-02'],
    'Produto': ['A', 'B', 'A', 'B'],
    'Vendas': [100, 200, 150, 250]
})

df

         Data Produto  Vendas
0  2024-03-01       A     100
1  2024-03-01       B     200
2  2024-03-02       A     150
3  2024-03-02       B     250

In [3]:
# Pivot Table
pivot = df.pivot_table(index='Data', columns='Produto', values='Vendas', aggfunc='sum')

pivot

Produto       A    B
Data
2024-03-01  100  200
2024-03-02  150  250

In [6]:
# Melt
melted = pivot.reset_index().melt(id_vars='Data', value_vars=['A', 'B'], var_name='Produto', value_name='Vendas')

melted

         Data Produto  Vendas
0  2024-03-01       A     100
1  2024-03-02       A     150
2  2024-03-01       B     200
3  2024-03-02       B     250

In [27]:
df = pd.DataFrame({
    'Categoria': ['A', 'A', 'B', 'B'],
    'Tipo': ['X', 'Y', 'X', 'Y'],
    'Valor1': [10, 20, 30, 40],
    'Valor2': [100, 200, 300, 400]
})

df

  Categoria Tipo  Valor1  Valor2
0         A    X      10     100
1         A    Y      20     200
2         B    X      30     300
3         B    Y      40     400

In [28]:
# Stack
df.set_index(['Categoria', 'Tipo'], inplace=True)

df

                Valor1  Valor2
Categoria Tipo
A         X         10     100
          Y         20     200
B         X         30     300
          Y         40     400

In [29]:
df.index

MultiIndex([('A', 'X'),
            ('A', 'Y'),
            ('B', 'X'),
            ('B', 'Y')],
           names=['Categoria', 'Tipo'])

In [31]:
df.index.levels

FrozenList([['A', 'B'], ['X', 'Y']])

In [39]:
display(df.groupby(level=0).sum())

display(df.groupby(level=0).sum().reset_index())

           Valor1  Valor2
Categoria
A              30     300
B              70     700

  Categoria  Valor1  Valor2
0         A      30     300
1         B      70     700

In [22]:
stacked = df.stack()

stacked

Categoria  Tipo
A          X     Valor1     10
                 Valor2    100
           Y     Valor1     20
                 Valor2    200
B          X     Valor1     30
                 Valor2    300
           Y     Valor1     40
                 Valor2    400
dtype: int64

In [23]:
# Unstack
unstacked = stacked.unstack()

unstacked

                Valor1  Valor2
Categoria Tipo
A         X         10     100
          Y         20     200
B         X         30     300
          Y         40     400